Revit 2027 API
BuiltInFailures.BendFailures.NotBentControl Property
 While making curved beam type "[Type Name]" some Control elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentControl { get; }
Public Shared ReadOnly Property NotBentControl As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentControl {
	FailureDefinitionId^ get ();
}
static member NotBentControl : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace